backend: tensorflow
class_name: Sequential
config:
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block1_conv1
    padding: same
    strides: &id002 !!python/tuple [1, 1]
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block1_conv2
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: block1_pool
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: false
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 128
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block2_conv1
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 128
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block2_conv2
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: block2_pool
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: false
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 256
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block3_conv1
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 256
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block3_conv2
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 256
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block3_conv3
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: block3_pool
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: false
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 512
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block4_conv1
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 512
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block4_conv2
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 512
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: block4_conv3
    padding: same
    strides: *id002
    trainable: false
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: block4_pool
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: false
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: relu, dtype: float32, name: activation, trainable: true}
- class_name: BatchNormalization
  config:
    axis: [3]
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {dtype: float32}
    beta_regularizer: null
    center: true
    dtype: float32
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {dtype: float32}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {dtype: float32}
    moving_variance_initializer:
      class_name: Ones
      config: {dtype: float32}
    name: batch_normalization
    scale: true
    trainable: true
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_1
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: relu, dtype: float32, name: activation_1, trainable: true}
- class_name: BatchNormalization
  config:
    axis: [3]
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {dtype: float32}
    beta_regularizer: null
    center: true
    dtype: float32
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {dtype: float32}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {dtype: float32}
    moving_variance_initializer:
      class_name: Ones
      config: {dtype: float32}
    name: batch_normalization_1
    scale: true
    trainable: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: max_pooling2d
    padding: valid
    pool_size: &id003 !!python/tuple [2, 2]
    strides: *id003
    trainable: true
- class_name: Dropout
  config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.25, seed: null,
    trainable: true}
- class_name: Flatten
  config: {data_format: channels_last, dtype: float32, name: flatten, trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense
    trainable: true
    units: 1024
    use_bias: true
- class_name: Activation
  config: {activation: relu, dtype: float32, name: activation_2, trainable: true}
- class_name: BatchNormalization
  config:
    axis: [1]
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {dtype: float32}
    beta_regularizer: null
    center: true
    dtype: float32
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {dtype: float32}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {dtype: float32}
    moving_variance_initializer:
      class_name: Ones
      config: {dtype: float32}
    name: batch_normalization_2
    scale: true
    trainable: true
- class_name: Dropout
  config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.5, seed: null,
    trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_1
    trainable: true
    units: 1
    use_bias: true
- class_name: Activation
  config: {activation: sigmoid, dtype: float32, name: activation_3, trainable: true}
keras_version: 2.1.6-tf
