{"backend": "tensorflow", "config": [{"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block1_conv1", "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block1_conv2", "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block1_pool", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block2_conv1", "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block2_conv2", "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block2_pool", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block3_conv1", "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block3_conv2", "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block3_conv3", "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block3_pool", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block4_conv1", "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block4_conv2", "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "block4_conv3", "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block4_pool", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d", "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "name": "activation", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "axis": [3], "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization", "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "axis": [3], "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_1", "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout", "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "units": 1024, "trainable": true, "bias_constraint": null, "name": "dense", "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "axis": [1], "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_2", "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_1", "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 1, "trainable": true, "bias_constraint": null, "name": "dense_1", "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "name": "activation_3", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.1.6-tf", "class_name": "Sequential"}